[
  {
    "id": "story_1",
    "title": "Encountering the Divine Presence",
    "content": "I was traveling with a young Western fellow in India. We had come to the mountains in a Land Rover I had borrowed from a friend, in order to find this fellow’s guru to get some help with his visa problem. I was in a bad mood, having smoked too much hashish, been in India “too long,” and not particularly wanting to visit a “guru” anyway\n\n[The following is adapted from the book, Be Here Now. ]\n\nWe stopped at this temple and he asked where the guru was. The Indians who had gathered around the car pointed to a nearby hill. In a moment he was out of the car and running up the hill. They were following him and appeared delighted to be able to see the guru. I got out of the car. Now I was additionally upset because everybody was ignoring me. I ran after them, barefoot, up this rocky path, stumbling all the way. I didn’t want to see the guru anyway and what the hell was this all about\n\nAround a bend of the path I came to a field overlooking a valley, and in the field under a tree sat a man in his sixties or seventies with a blanket around him. Surrounding him were eight or nine Indians. I was aware of the beautiful tableau—the group, the clouds, the green valley, the visual purity of the foothills of the Himalayas\n\nMy traveling companion ran to this man and threw himself on the ground, doing dunda pranam (full-length prostration). He was crying and the man was patting him on the head. I was more and more confused\n\nI stood to the side, thinking, “I’m not going to touch his feet. I don’t have to. I’m not required to do that. ” Every now and then this man looked up at me and twinkled a little. His glances just made me more uncomfortable\n\nThen he looked at me and started speaking in Hindi, of which I understood very little. Another man, however, was translating. I heard him ask my friend, “You have a picture of Maharajji. ”\n\nMy friend nodded, “Yes. ”\n\n“Give it to him,” said the man in the blanket, pointing at me\n\n“That’s very nice,” I thought, “giving me a picture of himself,” and I smiled and nodded appreciatively. But I was still not going to touch his feet\n\nThen he said, “You came in a big car. ”\n\n“Yes. ” (I hadn’t wanted to borrow the car in the first place, not wanting the responsibility, so the car was a source of irritation for me. )\n\nHe looked at me, smiling, and said, “You will give it to me. ”\n\nI started to say, “Wha …” but my friend looked up from the ground where he was still lying and said, “Maharajji, if you want it, you can have it. It’s yours. ”\n\nAnd I said, “No, now wait a minute. You can’t give away David’s car like that. ” The old man was laughing\n\nIn fact, everyone was laughing—except me\n\nThen he said, “You made much money in America. ”\n\nI reviewed all my years as a professor and smuggler and very proudly said, “Yes. ”\n\n“How much did you make. ”\n\n“Well,” I said, “at one time”—and I sort of upped the figure a bit further to inflate my ego—“twenty-five thousand dollars. ”\n\nThe group converted that into rupees, and everybody was awed by this figure. All of this was of course bragging on my part. I had never made twenty-five thousand dollars. And he laughed again and said, “You’ll buy a car like that for me. ”\n\nI remember what went through my mind at that moment. Although I had come from a family of Jewish fund-raisers, I had never seen such hustling as this. “He doesn’t even know my name and already he wants a seven-thousand dollar vehicle,” I thought\n\n“Well, maybe …” I said. The whole thing was by now upsetting me very much\n\nAnd he said, “Take them away and give them food. ” And so we were given magnificent food, and then we were told to rest. Sometime later we were back with Maharajji and he said to me, “Come here. Sit. ” So I sat down facing him and he looked at me and said, “You were out under the stars last night. ” (This, of course, was the English translation of what he said. )\n\n“You were thinking about your mother. ”\n\n“Yes. ” (The previous night a few hundred miles away I had gone outside during the night to go to the bathroom. The stars had been very bright and I had remained outside, feeling very close to the cosmos. At that time I had suddenly experienced the presence of my mother, who had died nine months previously of a spleen condition. It was a very powerful moment, and I had told no one about it. )\n\nShe died last year. ”\n\n“She got very big in the stomach before she died. ”\n\nHe leaned back and closed his eyes and said (in English), “Spleen, she died of spleen. ”\n\nWhat happened to me at that moment I can’t really put into words. He looked at me in a certain way and two things happened. They do not seem like cause and effect, but rather appeared to be simultaneous\n\nMy mind began to race faster and faster to try to get leverage—to get a hold on what he had just done. I went through every super-CIA paranoia I’d ever had: “Who is he. Who does he represent. Where’s the button he pushes to make the file appear. Why have they brought me here. ” None of it would jell\n\nIt was just too impossible that this could have happened this way. My traveling companion didn’t know about any of the things Maharajji was saying, and I was a tourist in a car. The whole thing was just inexplicable. My mind went faster and faster\n\nUntil then I had had two models for psychic experiences. One was: “Well it happened to somebody else, and it’s very interesting and we certainly must keep an open mind about these things. ” That was my social-science approach. The other one was: “Well, I’m high on LSD. Who knows how it really is. ” After all, I had had experiences under the influence of chemicals in which I had created whole environments\n\nBut neither of these categories applied to this situation, and as my mind went faster I felt like a computer that has been fed an insoluble problem—the bell rings and the red light goes on and the machine stops. My mind just gave up. It burned out its circuitry, its zeal to have an explanation. I needed something to get closure at the rational level and there wasn’t anything\n\nAt the same moment I felt this extremely violent pain in my chest and a tremendous wrenching feeling, and I started to cry. I cried and cried and cried, but I was neither happy nor sad. It was a kind of crying I had not experienced before. The only thing I could say about it was it felt as if I had finished something. The journey was over. I had come home. (R. D. )",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "spiritual seeking, doubt, family problems, addiction",
    "emotions": "confusion, grief, anger, joy, peace",
    "themes": "divine grace, guidance, healing, surrender, love",
    "lesson": "Sometimes, unexpected encounters can lead to profound healing and understanding.",
    "word_count": 1221
  },
  {
    "id": "story_2",
    "title": "The Journey to Maharajji's Love",
    "content": "In the words of Dada, “We all think we are chasing the guru, but really, you see, he is chasing us. ”\n\nAll I knew about the hardships of India made me sure I didn’t want to go there, yet in October of 1971 I found myself at JFK Airport with two friends, waiting to board a plane for Bombay. A large crowd of our New York “spiritual” group had come to see us off, or, as I suspected, to make sure we actually got on the plane. We were all three in varying states of panic, wondering what we were doing. Both the panic and the confusion were to intensify a hundredfold when we actually arrived in India\n\nWe three, like nearly all the group of Westerners we eventually joined around Maharajji, first heard of him through Ram Dass. Yet, though my life totally changed after the night I first heard Ram Dass lecture, I did not feel drawn to go to India. Partially, the mystique of what going to India represented in those days made it seem presumptuous for me to even consider the trip. Nor was it clear to me that the power of the awakening I had experienced was, in fact, a connection with Maharajji—that he could possibly be my guru. We had all heard how difficult it was to find him. And what if he sent me away as he had others\n\nNow, three years later, I was going to India, but I still hadn’t the temerity to chance rejection—I was going to see some south Indian saints and perhaps later “visit” up north, if there seemed any hope of being received\n\nComing off the plane in Bombay, we were met by an airline representative (in India, a feat in itself), who advised us that we had reservations on an afternoon flight to New Delhi and that tickets were waiting for us at the counter. This was a stunner, but after a twenty-six or twenty-eight-hour fight we were too dazed to feel more than mild wonder. After all, we were in India—anything could happen here. (This mystery of tickets and reservations to Delhi was never solved in any “reasonable” way. ) In Delhi, we thought of going to the American Express office to ask for messages, as we had planned to do in Bombay. After all, since we were here, there must be a message. There was: “Go to Jaipuria Bhavan in Vrindaban. Maharajji expected soon. ” It was signed, “Balaram Das. ” We didn’t know who that was\n\nWe learned that Vrindaban was not far from Delhi and that we could get there by an afternoon train. Somehow we never thought of pausing in the relative Westernness of Delhi. The message said go and go we did. We thereby learned the first great lesson of India: Never travel by third-class unreserved coach. It was the equivalent of a three-hour ride on a New York City subway at rush hour, with the addition of sunshine, dust, and engine smoke pouring in the open windows\n\nEventually, we battled our way off the train at Mathura, and in the glowing dusk of the Indian plain, whose beauty we could not then appreciate, we found a bus to take us to nearby Vrindaban. There we were put down in the large bazaar of what to all appearances was a thirteenth-century village of winding alleys full of people, rickshaws, dogs, pigs, and cows. By now it was dark and most of the illumination came from lanterns in the shops lining the streets. We asked for directions to “Jaipuria Bhavan” in our nonexistent Hindi and were directed first up one alley and then down another. It grew later and the shops were beginning to close. Our panic grew with our exhaustion and hunger, for even if we came upon the hostel we would not recognize it, for every sign was in Hindi. We began to envision ourselves huddling for the night among the cows in some doorway\n\nThen suddenly approaching us appeared a Westerner—someone whom I’d met the year before in California. In hysterical relief, I threw my arms around him, but he, an old-timer in India, was totally calm in the face of our emotion. Oh, yes, Jaipuria Bhavan was just there, around the next bend\n\nDuring the next few days, the small Western satsang (community of spiritual seekers) began gathering at Jaipuria Bhavan, awaiting Maharajji’s arrival at his Vrindaban ashram (monastery). Many of them we knew from America, including the mysterious “Balaram Das” whom we’d known as Peter. We heard their stories of Maharajji with relief and anticipation. He didn’t sound so fierce and terrifying after all. Then word came that he was here. The next morning we could go to have his darshan\n\nI arrived at the ashram a little late with Radha, nervously clutching my borrowed sari and the offering of flowers and fruit. We circumambulated the temple and pranammed (bowed) to Hanumanji2, then approached the gate in the wall between the temple garden and the ashram. How well I remember that green wooden door. When we knocked, the old chaukidar (gate-keeper) opened it a crack and peered out at us. Then, as each time afterward for as long as I was in India, I wondered if he would let us in. But he stepped back, pulling the door open for us. I looked through, down the vista of the long verandah along the front of the ashram building. At the far end, Maharajji was sitting alone on his wooden bed. When I saw his great form, my heart jumped so that I staggered against the gate. That first sight of him is still piercingly clear in my memory\n\nRadha had already rushed through and I ran after her, losing my sandals along the way. It was all so simple and familiar—bowing at his feet, giving the fruit and flowers (which he immediately threw back in my lap), weeping and laughing. Maharajji was bouncing, smiling, and crowing in English, “Mother from America. Mother from America. ” During that first darshan, though Maharajji spoke mainly in Hindi, I understood everything without the interpreter who stood nearby. And I recognized the love that had poured through Ram Dass, that had irresistibly drawn me to India: Here was the source",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "spiritual seeking, doubt, confusion, relationships",
    "emotions": "fear, panic, joy, relief, anticipation",
    "themes": "divine grace, guidance, love, devotion, surrender",
    "lesson": "The path to spiritual awakening often requires overcoming fear and doubt to embrace the love and guidance that awaits.",
    "word_count": 1051
  },
  {
    "id": "story_3",
    "title": "Encountering Divine Love and Healing",
    "content": "Everybody else was all excited, but I was pretty skeptical about the whole thing. Still, I was the first one off the bus and found myself running immediately into the temple. Even though I’d never been there, I somehow knew all the turns to make in order to get to where Maharajji was. As I came around the corner he started bouncing up and down and exclaiming all these things in Hindi that totally confused me. I came to him and bowed down at his feet\n\nHe began to hit me really very hard. I had both a sense of great confusion and a feeling of the most incredible at-oneness that I’ve ever felt in my life. He was so totally different from what I had expected yet so familiar at the same time. At that moment I felt all the suffering, all the pain from the last several years dissolve completely. And though the pain was to come back again in the future, the love I felt at that moment made it all a lot less painful later",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "spiritual seeking, doubt, relationships, emotional pain",
    "emotions": "confusion, joy, peace, at-oneness",
    "themes": "divine grace, love, healing, surrender, devotion",
    "lesson": "True healing often comes from unexpected encounters with divine love.",
    "word_count": 179
  },
  {
    "id": "story_4",
    "title": "Encountering Divine Presence in Simplicity",
    "content": "I had heard of Maharajji while wandering in India, and I finally found him in Allahabad. My first meeting was in the early morning. Maharajji was in a room on the bed, with a Ma (Indian woman devotee) sitting before him on the floor. There was fruit on the bed. Then out from under the big blanket came this hand. He took some big apples and kept bouncing them off the Ma’s chest, but she was totally absorbed in meditation. I sat watching, then suddenly Maharajji looked directly at me. He was like a tree, so grounded, so organic. He flipped me a banana and it landed right in my hand. I wondered what I should do with the banana, a sacred object. I figured it would be best to eat it",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "spiritual seeking, doubt, relationships",
    "emotions": "joy, peace, wonder",
    "themes": "divine grace, devotion, guidance, love",
    "lesson": "Sometimes, the simplest moments can reveal profound spiritual truths.",
    "word_count": 132
  },
  {
    "id": "story_5",
    "title": "Finding Home with Maharajji",
    "content": "I had come to India from the United States as a devotee in a very intense religious sect—the guru was the guru, the final and great savior. After only two weeks in his presence, I was dearly disillusioned about him and began to wander about India on my own, still hoping to find the one true and pure guru somewhere. Several times in my wanderings someone would tell me of Maharajji and that he was nearby. But I would not go, as I felt no particular pull. Finally I was down near Bombay, still seeking the true guru, when an old friend showed up. He looked so clear and light that before we even spoke I determined to go to wherever it was he had just come from. He had just left Maharajji in Vrindaban. I packed my bags and was gone that afternoon. Twenty-four hours later I was before Maharajji. There were a number of Westerners there. Maharajji did not speak to me but he kept looking very intently at my heart chakra (psychic energy center in the heart area of the body), and what I kept hearing, as a voice within me, was that my search was over. I had come home",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "spiritual seeking, doubt, relationships",
    "emotions": "confusion, despair, joy, peace",
    "themes": "divine grace, surrender, faith, guidance, love",
    "lesson": "True guidance often comes from within when we are open to it.",
    "word_count": 204
  },
  {
    "id": "story_6",
    "title": "Encountering Divine Love and Guidance",
    "content": "I was sitting for several months in Buddhist meditation in Bodh Gaya. About two-thirds of the way through the second month, this funny-looking little man started to appear in the upper-right-hand corner of my awareness. Every so often he’d smile. I wondered who he was and just watched him come and go. Later I began to suspect that it was Maharajji, whom I’d heard about the year before\n\nAt the end of the retreat I opened a copy of The Hundred Thousand Songs of Milarepa and a picture of Maharajji fell out. When we finally got to Vrindaban where he was supposed to be, we found the gates of the temple locked. Feeling very sad that I had come all this way only to find the gates locked, I went across the street and sat on the culvert\n\nAll of a sudden I felt as if Maharajji had come leaping over the wall, for I was completely surrounded and filled with the greatest love I had ever experienced. I burst into tears. People passing by saw this crazy, long-haired Westerner sobbing his guts out. They just looked at me and smiled and continued on\n\nI didn’t know what was going on, but I had the clear sense of being home. There was absolutely no question that I was exactly where I wanted to be. A month before I couldn’t have imagined such an experience, but here I was, so relieved, so happy. My heart seemed to have burst open\n\nShortly afterward we were allowed into the temple. Maharajji asked me all the usual questions, like who I was and where I was from and what I did. And then suddenly I found myself bowing, with my head at his feet—and feeling totally right about it. And he was patting me on the head, saying something like, “Welcome, glad to see you made it. Welcome aboard. ” All I wanted to do was to hang onto his feet, and I didn’t care at all that this wasn’t in any way consistent with my self-image",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "spiritual seeking, doubt, relationships",
    "emotions": "joy, peace, relief, love, confusion",
    "themes": "divine grace, devotion, love, guidance",
    "lesson": "True spiritual connection can bring profound joy and a sense of belonging.",
    "word_count": 343
  },
  {
    "id": "story_7",
    "title": "Encountering Divine Presence Through Doubt",
    "content": "My wife had met Maharajji and had come to get me in America and bring me back to meet him. When we first went to see Maharajji I was put off by what I saw. All these crazy Westerners wearing white clothes and hanging around this fat old man in a blanket. More than anything else I hated seeing Westerners touch his feet. On my first day there he totally ignored me. But after the second, third, fourth, fifth, sixth, and seventh day, during which he also ignored me, I began to grow very upset. I felt no love for him; in fact, I felt nothing. I decided that my wife had been captured by some crazy cult. By the end of the week I was ready to leave\n\nWe were staying at the hotel up in Nainital, and on the eighth day I told my wife that I wasn’t feeling well. I spent the day walking around the lake thinking that if my wife was so involved in something that was clearly not for me, it must mean that our marriage was at an end. I looked at the flowers, the mountains, and the reflections in the lake, but nothing could dispel my depression. And then I did something that I had really never done in my adult life. I prayed\n\nI asked God, “What am I doing here. Who is this man. These people are all crazy. I don’t belong here. ”\n\nJust then I remembered the phrase, “Had ye but faith ye would not need miracles\n\n“Okay, God, I don’t have any faith. Send me a miracle. ”\n\nI kept looking for a rainbow but nothing happened, so I decided to leave the next day\n\nThe next morning we took a taxi down to Kainchi to the temple, to say good-bye. Although I didn’t like Maharajji, I thought I’d just be very honest and have it out with him. We got to Kainchi before anyone else was there and we sat in front of his tucket (wooden bed) on the porch. Maharajji had not yet come out from inside the room. There was some fruit on the tucket and one of the apples had fallen on the ground, so I bent over to pick it up. Just then Maharajji came out of his room and stepped on my hand, pinning me to the ground. So there I was on my knees touching his foot, in that position I detested. How ludicrous\n\nHe looked down at me and asked, “Where were you yesterday. ” Then he asked, “Were you at the lake. ” (He said “lake” in English. )\n\nWhen he said the word “lake” to me I began to get this strange feeling at the base of my spine, and my whole body tingled. It felt very strange\n\nHe asked me, “What were you doing at the lake. ”\n\nI began to feel very tight\n\nThen he asked, “Were you horseback riding. ”\n\n“Did you go swimming. ”\n\nThen he leaned over and spoke quietly, “Were you talking to God. Did you ask for something. ”\n\nWhen he did that I fell apart and started to cry like a baby. He pulled me over and started pulling my beard and repeating, “Did you ask for something. ”\n\nThat really felt like my initiation. By then others had arrived and they were around me, caressing me, and I realized then that almost everyone there had gone through some experience like that. A trivial question, such as, “Were you at the lake yesterday. ” which had no meaning to anyone else, shattered my perception of reality. It was clear to me that Maharajji saw right through all the illusions; he knew everything. By the way, the next thing he said to me was, “Will you write a book. ”\n\nThat was my welcome. After that I just wanted to rub his feet",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "relationships, spiritual seeking, doubt",
    "emotions": "confusion, despair, hopelessness, joy",
    "themes": "divine grace, faith, miracles, guidance, devotion",
    "lesson": "True transformation often arises from the depths of doubt and vulnerability.",
    "word_count": 653
  },
  {
    "id": "story_8",
    "title": "Encountering the Divine in Everyday Life",
    "content": "It was in London. I was on a bus with many empty seats. Then an old man carrying a blanket got on the bus and chose to sit on the window seat beside me, so that I had to stand up to let him in. This annoyed me somewhat, but as he sat down he gave me such a sweet, gentle smile that I forgot my annoyance and sat thinking to myself, “What a sweet old man. ” Before the bus came to the next stop on its route I turned to look at him again—but he was gone\n\nThe bus had not stopped again since he had gotten on. How could he have gotten off without my standing to let him pass\n\nLater I went to India on the advice of a friend who had been there, and I saw a picture of Maharajji—it was the same man. I located Maharajji and found out that on the day I had seen him on the bus in London carrying a specific plaid blanket, a woman in India had given Maharajji just such a blanket, which he was wearing that same day\n\nTHE INDIANS ALSO came to Maharajji with varying degrees of desire and readiness. But for them it was different. They had grown up in a culture in which holy beings abounded, and the parents of most of them had had gurus. For the family, the guru was a combination of grandfather, worldly and spiritual guide, and reflection or manifestation of God. They often treated Maharajji more as a man and less as a God, and yet at the same time they could surrender more easily to him. For them, surrender was not a personal matter of ego as it was for us. In the group of stories about initial meetings described by some of Maharajji’s closest Indian devotees, both the differences of culture and the similarity of opening and love are apparent\n\nI have known Maharajji since I came into this world. My father and mother were both devotees—my father since 1940 and my mother since 1947. Because our parents were devotees and because he was always being discussed in our family, we were all born devotees of him",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "spiritual seeking, family problems, relationships",
    "emotions": "confusion, joy, peace, wonder",
    "themes": "divine grace, surrender, faith, devotion, love, miracles",
    "lesson": "Sometimes, divine encounters happen in the most unexpected ways, reminding us of the interconnectedness of all beings.",
    "word_count": 370
  },
  {
    "id": "story_9",
    "title": "Meeting Neem Karoli Baba",
    "content": "I first met Maharajji in Bhowali many years ago. Maharajji frequently visited a certain Ma’s home there. I told her that I had heard about him but had never met him, and I asked her to tell me the next time he came. After a week or so Maharajji came at night. In the morning a message came for me and I went at once. I found him lying on a cot. He looked at me, then closed his eyes for a moment. He knew at once who I was, who I had been before, and what I was going to do in this world. In a few seconds, he said, “I am very pleased to see you,” which he repeated many times. Maharajji had walked from Nainital to Bhowali during the night. He said, “You have brought me here. I shall see you again in Haldwani. ” Then Maharajji boarded a bus for Almora. (In those days he traveled mostly by bus, not by car. ) People warned me not to take him seriously: “Neem Karoli is a big liar. He very seldom tells the truth. You can’t depend on him. ”\n\nIn any case, I went to Haldwani. After a few days someone came to my room and told me that Maharajji had come to Haldwani and gave me his address. I saw him then and have been with him ever since",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "spiritual seeking, doubt, relationships",
    "emotions": "joy, peace, confusion, hope",
    "themes": "divine grace, faith, guidance, devotion",
    "lesson": "Trust in the journey of spiritual seeking, as guidance often comes unexpectedly.",
    "word_count": 234
  },
  {
    "id": "story_10",
    "title": "Encountering Divine Grace Through Maharajji",
    "content": "I first met Maharajji in 1950 when I rode with my boss and Maharajji from Nainital to Haldwani. My boss, a government minister, was already a devotee of Maharajji’s and had offered him this lift. But I was smoking and acting as if Maharajji was just another person. In 1958, after the death of my mother, I was in Bhowali with my father, on vacation. We spent a night in the government rest house there and my father became ill in the night, in much pain. They called the Bhowali doctor who gave him an injection but to no avail. The next day, doctors from Nainital came and said that he needed an emergency gall bladder operation. That same day I went to consult doctors at the nearby TB sanatorium. Preparations were then underway for a puja (ritual of prayer) to celebrate the opening of a small Hanuman temple built by the doctor there who was a devotee of Maharajji. I stayed on to watch. Maharajji arrived but stayed hidden. I grew curious to meet him. I heard that Maharajji had put someone in a trance, so I watched a while from a distance before leaving\n\nThat evening a messenger from the Nainital bus station came to me and told me to visit a certain Baba Neem Karoli. Since there are so many babas, I dismissed the message. But at night I went to the bus station and inquired as to who had sent this message, but no one knew. This aroused my curiosity even more. I asked where I could find this Baba Neem Karoli and went there. Maharajji said to me, “Your name is so-and-so and your father is very ill. ”\n\n“You thought he might die, but God has cured him. Doctors have told you that he should be operated on. But he shouldn’t be. He’ll be all right. ”\n\nMaharajji gave me two or three mangos for my father, which I fed to him and he began to improve. After a few days Maharajji again called me. I went but didn’t touch his feet. I was planning to return to Delhi and Maharajji said, “You’re going to Delhi. You drive too fast. Take your father carefully and he’ll be all right. ” This touched my heart and I touched Maharajji’s feet. My father never had the operation and became very healthy, with no relapse",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "illness, family problems, seeking guidance",
    "emotions": "worry, fear, hope, joy",
    "themes": "divine grace, healing, faith, miracles, devotion",
    "lesson": "Trusting in divine guidance can lead to unexpected healing and peace.",
    "word_count": 398
  },
  {
    "id": "story_11",
    "title": "The Transformative Power of Devotion",
    "content": "Since I wasn’t married, I was living with my brother and his wife. When Maharajji came to them I went into the farthest room so I wouldn’t have to be involved with such people, for I thought, “Sadhus (renunciates) are no good. ” After some time Maharajji came into the room where I was. He walked in, sat down, and said, “Sadhus are no good. ” After that I just became a devotee\n\nONE OF Maharajji’s closest devotees for the last twenty years gives the following account:\n\nIn 1935 I was on vacation from school and went to Dakshineshwar on a religious pilgrimage. When I reached the place where there were many Shiva temples, a man appeared before me whom I had not noticed to be there before\n\n“My son,” the man said, “you are a Brahmin. I shall give you a mantra. ”\n\n“I will not take it,” I said, “I do not believe in it. ”\n\n“You must take it,” he insisted, and so I relented\n\nThereafter, I faithfully recited the mantra daily. Many years passed\n\nIt was June 1955. I had some close friends who were like members of the family. Every Sunday we’d chat in the evening at our house. Around 9:00 P. M. , I saw my wife, aunt, and mother going out. I asked them where they were going, and they said just to an adjacent house, that some baba was visiting. One of the fellows with me said cynically, “Does he eat. I can arrange food for him. ” (This fellow was a hunter. )\n\nMy wife said, “You should not say things like that. ”\n\nIn ten minutes they returned. They reported that he had been sitting in a dirt hut with an oil lamp and had told them to go. When they didn’t go, he said, “Go. Your husband’s Bengali friends have come. Go and serve them tea. I shall come in the morning. ”\n\nIn the morning my wife and I went over together. Maharajji was on a small cot in a tiny room. As we entered he sprang up and took my hand, saying, “Let’s go. ” We left so fast that my wife had to remove her sandals to keep up. He took us to our own house and said, “I shall stay with you. ” When the women from the other house came to take him back he would not go\n\nLater he questioned me: “You are a devotee of Shiva. ”\n\n“You already have a mantra. ” It was at that moment that I realized it had been Maharajji who had given me the mantra twenty years before",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "spiritual seeking, doubt, relationships, family problems",
    "emotions": "confusion, skepticism, joy, peace",
    "themes": "divine grace, faith, devotion, guidance, miracles",
    "lesson": "True devotion can lead to profound transformation and understanding.",
    "word_count": 442
  },
  {
    "id": "story_12",
    "title": "Divine Guidance and Unasked Questions",
    "content": "My first meeting with him in Kanpur was short and sweet—perhaps only two minutes. I pranammed to him. He asked me who I was and gave me his blessing and left abruptly. Where he went, nobody could say\n\nI met him again ten months or a year later in Lucknow. One by one, he sent the many people who were sitting with him away until only we three were left. Then he asked my sister-in-law, “What do you want. ” She said she’d come only to pay her respects\n\nThen he asked me, and I replied, “I only need your blessings, nothing more. ”\n\nThen he said to my wife, “You have come with positive questions. Why don’t you ask them. ”\n\nIn fact she had come with some questions, which she hadn’t even confided in us. But she had made a decision beforehand not to ask the questions herself. She wanted Maharajji to answer them unasked, and she wanted it done in private, so she didn’t speak. She couldn’t answer that she didn’t have questions, but because of her decision she couldn’t ask them. So Maharajji said to her, “You want me to answer your questions without your asking. And you want me to tell you when you are alone. You are putting a sadhu to a very hard test. Tomorrow I will come to your house in Kanpur and answer your questions. ”\n\nWe sat there a few minutes more and then he said, “Go. ” As we were leaving a doubt came to my mind that Maharajji had just sidetracked us by saying he’d visit us tomorrow and answer the questions\n\nAt about ten o’clock that evening a message came to our house for a Maharajji devotee who was visiting us. The message was that Babaji (familiar form of Baba) was coming to the devotee’s house and he should return home right away. We accompanied him. As soon as I pranammed to Maharajji, he said, “You doubted my integrity. Never doubt a sadhu—the burden is on him, not on you. You have not to doubt. ” I apologized to him. I had indeed doubted. Then he said, “All right, tomorrow I’ll come to your place. ”\n\nSo the next morning he came over. As this was his first visit, I really didn’t know what to do. Others told me that nothing is to be done—just provide a big pillow on a bed for him to lean on and offer some food or fruit or milk. He’ll take whatever he feels like. It’s his sweet will\n\nWhen he arrived I escorted him to the sitting room. He said, “No, I won’t sit there. Let the others sit there; you take me to that small room. ” I was surprised and confused, since I did not know which small room he was referring to. He gave a description of the room and walked through the house as if he knew where the room was. I was following him, not leading him, in our house. He went straight to the room and said, “Here I want to sit. ” He said, “Call Ma” (my wife). She came, and he then answered all the questions she had in her mind. “Is there any question to which I haven’t replied. ” he asked. She had to say that there were no more",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "seeking guidance, doubt, spiritual seeking, family problems",
    "emotions": "confusion, doubt, peace, joy",
    "themes": "divine grace, faith, devotion, guidance, miracles",
    "lesson": "Trust in the divine and remain open to receiving guidance in unexpected ways.",
    "word_count": 560
  },
  {
    "id": "story_13",
    "title": "Transformation Through Devotion and Surrender",
    "content": "An ICS (Indian Civil Service) commissioner of Lucknow used to drink ferociously. The superintendent of police said to Maharajji that they should go visit him. Maharajji agreed, and when they arrived the commissioner had a bottle hidden behind him. Maharajji yelled from the car, “What’s the matter. ”\n\nThe commissioner was furious. He screamed at the superintendent: “Who have you brought here. He has no manners. Get him out of here. ”\n\nThe superintendent opened his holster and was about to shoot the commissioner for talking to Maharajji that way. But Maharajji blew up: “What are you doing. He is a great saint. You see only his outside. I’ll never come with you again. ”\n\nThe commissioner later became a great devotee. He would come for darshan but sit outside by the shoes for he felt that was his place. He eventually became head of the Administrative Officer School in Allahabad\n\nHe suffered from thrombosis. At the end he suffered great agony but kept Ram mantra (repetition of Ram, a name of God) going and was very gay. The superintendent was in tears when he visited him near the end, and he asked, “Should I call your wife and son. ”\n\nThe commissioner said, “No, this is not a time of attachment. At this time all I have to do is remember Ram and Maharajji. Good-bye. We’ll meet again. ” And he died",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "addiction, illness, seeking guidance, relationships",
    "emotions": "anger, grief, peace, joy, acceptance",
    "themes": "divine grace, faith, devotion, healing, surrender",
    "lesson": "True transformation comes from surrendering to divine guidance and maintaining faith, even in the face of suffering.",
    "word_count": 233
  },
  {
    "id": "story_14",
    "title": "The Quest for Maharajji's Darshan",
    "content": "I had wanted to meet Maharajji for a long time but could never catch him. Finally a friend came and took me in his company car to where Maharajji was supposed to be. There were four rooms and Maharajji was in the far room. I went in. The minute I entered, Majarajji said, “Get out, you. ”\n\nSo I went out and sat down but wouldn’t leave. I sat for many hours. Finally my friend had to return the car because it was closing time. Although my house was quite distant, I was determined to stay and have Maharajji’s full darshan. Finally someone took pity and said, “You aren’t doing it right. When some people start to go in, you go in with them, and if he throws you out, wait and try again with the next people. ” I did so and was twice thrown out. Finally, the third time, Maharajji said, “Come sit here. What is your name and what do you do. ” Then he said, “Okay, now go. ”\n\nBut I said, “I’m not going. I haven’t had darshan yet. I haven’t had a chance to discuss my problems with you. ”\n\nMaharajji said, “Go now and come at 6:00 A. M. ” So I went home but I couldn’t sleep, and at 2:00 A. I got up and did puja. I was afraid Maharajji would leave before I got there. When I arrived at the house at 6:00 A. Maharajji had already left, but they said he would return. After some time he did come back and then Maharajji and I spent many hours together. In fact, the rest of my life has been spent with Maharajji\n\n_________________________\n\n(R. D. ) denotes story concerning Ram Dass",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "spiritual seeking, relationships, doubt",
    "emotions": "determination, anxiety, hope, joy",
    "themes": "divine grace, faith, devotion, guidance",
    "lesson": "Persistence in seeking spiritual connection can lead to profound experiences and transformation.",
    "word_count": 291
  },
  {
    "id": "story_15",
    "title": "The Transformative Presence of Maharajji",
    "content": "A MEETING OF THE SPIRIT\n\nNOT EVERYONE WHO met Maharajji was “opened” or “awakened” at the initial visit. Many came, enjoyed a pleasant visit, and left apparently unaffected. They seemed to have “no business” with Maharajji, that is, they were either unready to be touched so deeply, or the vehicle of the guru or this particular guru was not their way\n\nBalaram (to a new arrival on the verandah at Vrindaban): “Have you had Maharajji’s darshan yet. ”\n\n“I don’t know. Is he the fat one sitting over there. ”\n\nTHEN THERE were those who while experiencing no dramatic “zap,” yet responded to some subtle thread that drew them back to Maharajji again and again\n\nI was astonished to watch the way in which tough people would melt as they stayed around Maharajji\n\nFOR MANY OF US who were either dramatically opened initially or subtly drawn, the desire that became uppermost in our lives was to be with Maharajji. We had become “devotees,” for when we were with him we were experiencing being “at home” in the heart of God. Little wonder that his presence became so addictive and that we would leave home and go to any lengths to be with this spiritual pied piper who was teaching us to dance and play in the fields of the Lord\n\nBut to assume that just because you wished to be with Maharajji, you could be, did not take into account the nature of this man’s behavior. He moved about unpredictably. And whenever he stayed in any one place for even a few days, people would arrive in a continuous stream from morning to night. Some came barefoot with naked babies from nearby farms; others came by jet and taxi\n\nI was standing in the front yard of a humble house in a little village in the hills when Maharajji arrived unexpectedly. I was told to remain outside, so I had the opportunity to watch the people come. They seemed to appear almost out of nowhere, arriving from all directions. They were running, some of the women wiping the flour from their hands on their aprons, others carrying their babies half dressed. The men had left their shops unattended. Some were pulling flowers from the trees as they came to have something to offer …. But they came with an expectancy, with a joy, with a reverence, that could not be mistaken. (R. D. )",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "spiritual seeking, relationships, doubt",
    "emotions": "joy, peace, reverence, confusion",
    "themes": "divine grace, devotion, guidance, love",
    "lesson": "The presence of a true spiritual teacher can awaken deep devotion and a sense of belonging in the heart of seekers.",
    "word_count": 404
  },
  {
    "id": "story_16",
    "title": "The Elusive Presence of Maharajji",
    "content": "True, many wanted something worldly from the “miracle baba,” but beyond that they wanted once again to taste of the nectar of being with him\n\nMANY OF US vacillated in our reactions to this constant demand upon Maharajji. At one moment we saw ourselves and the other devotees and seekers as so many vultures around a piece of raw meat or like flies crawling over a piece of sugar. At those times we tried to protect him, and often we held back so as not to contribute to the scene\n\nBut at other times we would realize how totally Maharajji had control of the situation. When he felt that people were, as he put it, “eating his head,” he would simply go into a back room and close the door, or send everyone away, or get in a car and leave without a backward glance. Once, after traveling many months to see Maharajji, we at last found him at a devotee’s home in Delhi. We were allowed into the back room with him for a few minutes and then were sent out to have tea with many others. About fifteen minutes later Maharaijji walked out of the inner room and right by us, not more than two feet from our faces, with not the least turn of the head or signal of recognition. He went to a car in which a driver was waiting, he got in, and the car left for a destination unknown. Such a person was clearly not at our mercy\n\nSo Maharajji kept continually on the move, in a totally unpredictable fashion. Within a temple compound he would move from place to place, at one moment freely available, while at the next closeted in some room with the door securely bolted\n\nWere that his only movement, devotees could settle near the temple and just visit each day and wait for the moments when he would appear. But his movement was not limited to a single compound. Rather, he wandered from village to village, from the mountains to the plains, from one end of India to the other, from temples to private homes to jungle ashrams. In the middle of the night he might leave unannounced for a destination unknown. Or he might board a train and be destined for a certain city, only to leave the train at some other station, sometimes so quickly, even as the train was moving, that devotees who had followed him were left behind\n\nThe intense desire of the devotees to be with Maharajji, combined with his elusive and unpredictable behavior, gave rise to the most intricate dramas of hide and seek, labeled by one waggish devotee as the “great grace race. ”\n\nBeing a devotee of Maharajji was like participating in a continuous and unending treasure hunt, limited only by economic resources or family responsibilities. The pot of gold was, of course, darshan with Maharajji. And gold it was. One Indian devotee put it succinctly when he said, “Even sexual intercourse with my wife cannot equal darshan with Maharajji. ”\n\nTHE INDIAN DEVOTEES had an intricate communication system that allowed them at least thirty percent of the time to trace Maharajji and know of his whereabouts within a day of his arrival in any town or village. We Westerners were not so lucky, and so we had to use our wits, our intuitions, our cunning—and our unmitigated gall—to get to his feet. Our percentage of success was perhaps not so impressive as that of the Indian devotees, but our style and our dramatic entrances and exits certainly were",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "spiritual seeking, relationships, doubt, family problems",
    "emotions": "longing, joy, confusion, frustration, devotion",
    "themes": "divine grace, surrender, faith, devotion, miracles",
    "lesson": "The journey to connect with the divine often involves patience, persistence, and the understanding that true presence transcends physical proximity.",
    "word_count": 598
  },
  {
    "id": "story_17",
    "title": "Unexpected Encounters with Maharajji",
    "content": "I was having Maharajji’s darshan and all of a sudden Tukaram walked up. I asked Tukaram how he had gotten in and he said, “Oh, I jumped over the wall. ” And I thought, “Oh, God. Well, I won’t be here for long. ” Then Krishna Priya climbed in. The chaukidar saw her clambering over the wall and since he didn’t want to take the blame for letting them in, he went to tell Maharajji. The gate-keeper said, “Baba, these people climbed over the wall. I’m sorry. I did the best I could to keep them out. ” Maharajji’s initial reaction to the chaukidar’s report was rage: “Get ‘em out. Get ‘em all out. ” I got thrown out too. We Westerners shared the guilt among us. We came back the next day for darshan and discovered that overnight the wall had been doubled in height\n\nMANY LEVELS—MANY CHANGES\n\nWHEN YOU FINALLY arrived at the right place at the right time and were told, “Yes, he’s here,” and found yourself seated before him, what was it like. Even the tongues and hands of the gods and goddesses of speech, music, and poetry could not do justice to those occasions. So how could I. Like the blind men with the elephant, each devotee met a different Maharajji\n\nWhen Maharajji came out you never knew what to expect. He could do the same thing a week in a row until you’d think, “Well, he’ll come out at 8:00. ” Then he might not come out all day, or he might just go into another room and close the door and be in there for two days. You had to learn to expect the unexpected. One day he came out and all he said all day long was “Thul-Thul, Nan-Nan,” repeating these words to himself like a mantra. Days went by like this and somebody finally said, “Maharajji, what are you saying. ” And it turned out to be an old Behari dialect, and all it meant was “Too big, too big, too little, too little. ” When he was finally asked why he was saying this, he said, “Oh, all you people, you all live in Thul-Thul, Nan-Nan; you live in the world of judgement. It’s always too big or too little. ”",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "spiritual seeking, relationships, doubt",
    "emotions": "confusion, joy, peace, anger",
    "themes": "divine grace, surrender, faith, devotion, guidance",
    "lesson": "Embrace the unexpected in your spiritual journey, as it often leads to deeper understanding and growth.",
    "word_count": 381
  },
  {
    "id": "story_18",
    "title": "The Unseen Gifts of Darshan",
    "content": "You can never know, as you sit before Maharajji, who it is that he is working with in the course of a darshan. He may be talking with one person while another is being deeply moved in some special way. You yourself can’t know what you are receiving from him",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "spiritual seeking, doubt, relationships",
    "emotions": "confusion, peace, joy",
    "themes": "divine grace, guidance, love",
    "lesson": "The true impact of spiritual presence often transcends our immediate understanding.",
    "word_count": 50
  },
  {
    "id": "story_19",
    "title": "The Joy of Presence with Maharajji",
    "content": "One aspect of being with Maharajji that struck me and a lot of people was the multi-leveled nature of the experience. We would just be sitting with him and seemingly nothing much would be happening. We’d be having tea, and sometimes he would throw some fruit around, or somebody would come and say a few words. It was all very low-key, but we’d be watching everything that he would do, taking the most extreme delight in the tilt of his head or the movement of his arms. At the same time that we would experience an incredible light joy, we’d also have the sensation that we were in the midst of a raging fire",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "spiritual seeking, relationships, doubt",
    "emotions": "joy, peace, confusion, delight",
    "themes": "divine grace, surrender, faith, devotion",
    "lesson": "True spiritual experiences can bring profound joy and clarity even in simplicity.",
    "word_count": 114
  },
  {
    "id": "story_20",
    "title": "The Play of Love and Grace",
    "content": "People are sitting quietly around Maharajji, concentrating. Maharajji faces the opposite direction of a person when he picks up on a loose thought and then he rolls to face the person. With an expression of annoyance and love, he raises one finger or shakes his fist. If someone is meditating, he tweaks his nose or pulls his beard. He turns to a person and tells her that she is very good. Another he maligns, telling all sorts of bad stories. Again he turns to another and says, “Go. You wicked person. ”\n\nAND THE WORDS and apples and tea and silences and laughter were all washed in a continuous river of love that poured forth from Maharajji. The devotees who “knew” were equally as happy with Maharajji’s insults as with his praise, for it was all palpable love and food for the spirit\n\nWe took our cue in this respect from one of Maharajji’s long-term, trusted devotees, called “Dada,” who served Maharajji with a singleness of purpose that awed us. When Maharajji would compliment him, Dada would say, “Ha, Baba,” meaning, “Yes, Baba,” and when Maharajji would shout insults at him, sometimes upbraiding him from morning till night, he would reply, in exactly, the same tone, “Ha, Baba. ” Obviously, fame and shame were one to him, at least when Maharajji was the source. No longer could Maharajji get Dada angry or guilty; over the years it had all been burned out. For Dada, it was all grace\n\nSometimes Maharajji would talk to one person and everyone else would listen, perfectly content just to be present\n\nTHERE WAS THE sport of watching the newcomers arrive, skeptical, with questions, and then seeing their hearts gently open and their soft, flowerlike quality emerge under the tender care of the master gardener. We would sit in those groups as Maharajji turned this way and that, attending now to a person at his side and the next moment to a devotee far distant who was just entering the temple; and changing the mood of the group from easy laughter to fierce intensity in a moment and then back again. One felt at such times as if Maharajji was the puppeteer and we the puppets\n\nMaharajji’s company was very special. He was always natural, like a child, a saint in the traditional manner. He set no conditions nor expected any particular behavior from his devotees. He was rarely affected by the outside. He could converse with half a dozen people simultaneously with a camera held a foot from his face. He had no form. He performed no rituals or puja. He followed no orthodox customs such as ritual bathing. Yet his presence was more than inspiring; it was enlightening. While meditating in or near his presence, even though he’d be talking and joking loudly, one quickly reached the place of clear light, a place difficult to achieve without his grace and power\n\nMAHARJJI OFTEN counseled the Indian devotees to sit in silence; just to sit, listen, and absorb. But around Maharajji that was difficult to do, for there was a continuous and compelling drama going on around him: who came, who went; what they said; what food was being distributed; who got to sit closest to him; how he was working with each person; which person he petted and which he yelled at; how he moved about on the tucket. One Indian told us that those of us who did not speak Hindi were lucky, because it kept us from getting too involved. When there was a little silence or when you could detach yourself from the melodrama, you could just bask in the timeless grace of his presence\n\nThe minute you meet him, if you are ready, he will plant himself within you—the seed. And time is nothing",
    "source_url": "Miracle of Love, Ram Dass",
    "life_situations": "spiritual seeking, relationships, doubt",
    "emotions": "joy, peace, confusion, anger",
    "themes": "divine grace, love, devotion, guidance",
    "lesson": "Embracing both praise and criticism from a spiritual teacher can lead to profound inner growth and understanding.",
    "word_count": 634
  }
]